pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L433xx"/>
        <debug svd="CMSIS/SVD/STM32L4x3.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L43x_44x_45x_46x.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory                                  id="IRAM1"  start="0x20000000" size="0x0000C000" init="0" default="1"/>
        <memory                                  id="IRAM2"  start="0x10000000" size="0x00004000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM"   start="0x1FFF7800" size="0x00000014"          default="0"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="USBD"     n="1"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- ################ 256 KB ################ -->
        <!-- ***** Device 'STM32L433CCTx' ***** -->
        <device Dname="STM32L433CCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- ***** Device 'STM32L433CCUx' ***** -->
        <device Dname="STM32L433CCUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- ***** Device 'STM32L433CCYx' ***** -->
        <device Dname="STM32L433CCYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="48"/>
        </device>
        <!-- ***** Device 'STM32L433RCIx' ***** -->
        <device Dname="STM32L433RCIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="64" />
        </device>
        <!-- ***** Device 'STM32L433RCTx' ***** -->
        <device Dname="STM32L433RCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L433RCTxP' ***** -->
        <device Dname="STM32L433RCTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="64" />
        </device>
        <!-- ***** Device 'STM32L433RCYx' ***** -->
        <device Dname="STM32L433RCYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="64" />
        </device>
        <!-- ***** Device 'STM32L433VCTx' ***** -->
        <device Dname="STM32L433VCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
