pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <!-- ***** Device 'STM32L452CCUx' ***** -->
        <device Dname="STM32L452CCUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- ***** Device 'STM32L452VCTx' ***** -->
        <device Dname="STM32L452VCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L452VCIx' ***** -->
        <device Dname="STM32L452VCIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L462' ***** -->
      <subFamily DsubFamily="STM32L462">
        <book name="Documentation/DM00151940.pdf" title="STM32L41xxx STM32L42xxx STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual"/>
        <book name="Documentation/DM00340637.pdf" title="STM32L462CE STM32L462RE STM32L462VE Data Sheet"/>

        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L462xx"/>
        <debug svd="CMSIS/SVD/STM32L4x2.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L43x_44x_45x_46x.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00020000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <!-- ################ 512 KB ################ -->
        <!-- ***** Device 'STM32L462RETx' ***** -->
        <device Dname="STM32L462RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L462REYx' ***** -->
        <device Dname="STM32L462REYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L462REIx' ***** -->
        <device Dname="STM32L462REIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="64"/>
        </device>
        <!-- ***** Device 'STM32L462CEUx' ***** -->
        <device Dname="STM32L462CEUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- ***** Device 'STM32L462VETx' ***** -->
        <device Dname="STM32L462VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L462VEIx' ***** -->
        <device Dname="STM32L462VEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="100"/>
        </device>
      </subFamily>

