pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L476xx"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory                                  id="IRAM1"  start="0x20000000" size="0x00018000" init="0" default="1"/>
        <memory                                  id="IRAM2"  start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM"   start="0x1FFF7800" size="0x00000014"          default="0"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="3"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="1"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- ################ 256 KB ################ -->
        <!-- ***** Device 'STM32L476RCTx' ***** -->
        <device Dname="STM32L476RCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L476VCTx' ***** -->
        <device Dname="STM32L476VCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"    start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>

        <!-- ################ 512 KB ################ -->
        <!-- ***** Device 'STM32L476RETx' ***** -->
        <device Dname="STM32L476RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L476JEYx' ***** -->
        <device Dname="STM32L476JEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>
        <!-- ***** Device 'STM32L476MEYx' ***** -->
        <device Dname="STM32L476MEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="81"/>
        </device>
        <!-- ***** Device 'STM32L476VETx' ***** -->
        <device Dname="STM32L476VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L476QEIx' ***** -->
        <device Dname="STM32L476QEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>
        <!-- ***** Device 'STM32L476ZETx' ***** -->
        <device Dname="STM32L476ZETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>

        <!-- ################ 1 MB ################ -->
        <!-- ***** Device 'STM32L476RGTx' ***** -->
        <device Dname="STM32L476RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L476ZGTx' ***** -->
        <device Dname="STM32L476ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
        <!-- ***** Device 'STM32L476ZGTxP' ***** -->
        <device Dname="STM32L476ZGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="144" />
        </device>
        <!-- ***** Device 'STM32L476JGYx' ***** -->
        <device Dname="STM32L476JGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>
        <!-- ***** Device 'STM32L476JGYxP' ***** -->
        <device Dname="STM32L476JGYxP">
          <memory name="Main_Flash" access="rx" id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"      access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"  start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="72" />
        </device>
        <!-- ***** Device 'STM32L476MGYx' ***** -->
        <device Dname="STM32L476MGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="81"/>
        </device>
        <!-- ***** Device 'STM32L476VGTx' ***** -->
        <device Dname="STM32L476VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
