pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <!-- ***** Device 'STM32L496ZGTx' ***** -->
        <device Dname="STM32L496ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L496ZGTxP' ***** -->
        <device Dname="STM32L496ZGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="QFP" />
        </device>
        <!-- ***** Device 'STM32L496AGIx' ***** -->
        <device Dname="STM32L496AGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA"/>
        </device>
        <!-- ***** Device 'STM32L496AGIxP' ***** -->
        <device Dname="STM32L496AGIxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA" />
        </device>

        <!-- ################ 512 KB ################ -->
        <!-- ***** Device 'STM32L496VETx' ***** -->
        <device Dname="STM32L496VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature n="100" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L496AEIx' ***** -->
        <device Dname="STM32L496AEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA" />
        </device>
        <!-- ***** Device 'STM32L496QEIx' ***** -->
        <device Dname="STM32L496QEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature n="132" type="BGA"/>
        </device>
        <!-- ***** Device 'STM32L496RETx' ***** -->
        <device Dname="STM32L496RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature n="64" type="QFP" />
        </device>
        <!-- ***** Device 'STM32L496ZETx' ***** -->
        <device Dname="STM32L496ZETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature n="144" type="QFP" />
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4A6' ***** -->
      <subFamily DsubFamily="STM32L4A6">
        <book name="Documentation/DM00083560.pdf" title="STM32L47xxx, STM32L48xxx, STM32L49xxx and STM32L4Axxx Reference Manual" />
        <book name="Documentation/DM00284207.pdf" title="STM32L4A6xG Data Sheet" />

        <compile define="STM32L4A6xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

