pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <memory                                  id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
        <memory                                  id="IRAM2"  start="0x10000000" size="0x00010000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM"   start="0x1FFF7800" size="0x00000014"          default="0"/>

        <!-- ################ 1 MB ################ -->
        <!-- ***** Device 'STM32L4A6RGTx' ***** -->
        <device Dname="STM32L4A6RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="64" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L4A6RGTxP' ***** -->
        <device Dname="STM32L4A6RGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="64" type="QFP" />
        </device>
        <!-- ***** Device 'STM32L4A6VGTx' ***** -->
        <device Dname="STM32L4A6VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L4A6VGTxP' ***** -->
        <device Dname="STM32L4A6VGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L4A6VGYx' ***** -->
        <device Dname="STM32L4A6VGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="CSP"/>
        </device>
        <!-- ***** Device 'STM32L4A6VGYxP' ***** -->
        <device Dname="STM32L4A6VGYxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="CSP" />
        </device>
        <!-- ***** Device 'STM32L4A6QGIx' ***** -->
        <device Dname="STM32L4A6QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="132" type="BGA"/>
        </device>
        <!-- ***** Device 'STM32L4A6QGIxP' ***** -->
        <device Dname="STM32L4A6QGIxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="132" type="BGA" />
        </device>
        <!-- ***** Device 'STM32L4A6ZGTx' ***** -->
        <device Dname="STM32L4A6ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="QFP"/>
        </device>
        <!-- ***** Device 'STM32L4A6ZGTxP' ***** -->
        <device Dname="STM32L4A6ZGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="QFP" />
        </device>
        <!-- ***** Device 'STM32L4A6AGIx' ***** -->
        <device Dname="STM32L4A6AGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA" />
        </device>
        <!-- ***** Device 'STM32L4A6AGIxP' ***** -->
        <device Dname="STM32L4A6AGIxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4R5' ***** -->
      <subFamily DsubFamily="STM32L4R5">
        <processor  Dclock="120000000"/>
        <compile define="STM32L4R5xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4R5.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4Rx_4Sx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

