pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <memory                                  id="IRAM1"  start="0x20000000" size="0x000A0000" init="0" default="1"/>
        <algorithm name="CMSIS/Flash/STM32L4Rx_SB_OPT.FLM"   start="0x1FF00000" size="0x00000014"          default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4Rx_DB_OPT.FLM"   start="0x1FF00000" size="0x00000024"          default="0"/>

        <book name="Documentation/DM00310109.pdf" title="STM32L4+ Reference Manual" />
        <book name="Documentation/DM00366448.pdf" title="STM32L4R5xx STM32L4R7xx STM32L4R9 Data Sheet" />

        <!-- add device features -->

        <!-- ################ 1 MB ################ -->
        <!-- ***** Device 'STM32L4R5AGIx' ***** -->
        <device Dname="STM32L4R5AGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="BGA" n="169"/>
        </device>
        <!-- ***** Device 'STM32L4R5QGIx' ***** -->
        <device Dname="STM32L4R5QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>
        <!-- ***** Device 'STM32L4R5VGTx' ***** -->
        <device Dname="STM32L4R5VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L4R5ZGTx' ***** -->
        <device Dname="STM32L4R5ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
        <!-- ***** Device 'STM32L4R5ZGYx' ***** -->
        <device Dname="STM32L4R5ZGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="144"/>
        </device>

        <!-- ################ 2 MB ################ -->
        <!-- ***** Device 'STM32L4R5QIIx' ***** -->
        <device Dname="STM32L4R5QIIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>
        <!-- ***** Device 'STM32L4R5VITx' ***** -->
        <device Dname="STM32L4R5VITx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L4R5ZITx' ***** -->
        <device Dname="STM32L4R5ZITx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
        <!-- ***** Device 'STM32L4R5ZITxP' ***** -->
        <device Dname="STM32L4R5ZITxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="QFP" n="144" />
        </device>
        <!-- ***** Device 'STM32L4R5ZIYx' ***** -->
        <device Dname="STM32L4R5ZIYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="CSP" n="144"/>
        </device>
        <!-- ***** Device 'STM32L4R5AIIx' ***** -->
        <device Dname="STM32L4R5AIIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x000A0000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="1"/>
          <feature type="BGA" n="169"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4R7' ***** -->
      <subFamily DsubFamily="STM32L4R7">
        <processor  Dclock="120000000"/>
        <compile define="STM32L4R7xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4R7.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4Rx_4Sx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

