pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
<!-- correct memory layout
          <memory name="SRAM1"       access="rwx" start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory name="SRAM2"       access="rwx" start="0x20020000" size="0x00010000" default="1" init="0"/>
          <memory name="SRAM3"       access="rwx" start="0x20030000" size="0x00020000" default="1" init="0"/>
          <memory name="SRAM2alias"  access="rwx" start="0x10000000" size="0x00010000" default="0" alias="SRAM2"/>
  -->

        <!-- ################ 1 MB ################ -->
        <!-- ***** Device 'STM32L4P5CGTx' ***** -->
        <device Dname="STM32L4P5CGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- ***** Device 'STM32L4P5CGTxP' ***** -->
        <device Dname="STM32L4P5CGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="48" />
        </device>
        <!-- ***** Device 'STM32L4P5RGTx' ***** -->
        <device Dname="STM32L4P5RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L4P5RGTxP' ***** -->
        <device Dname="STM32L4P5RGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="64" />
        </device>
        <!-- ***** Device 'STM32L4P5VGTx' ***** -->
        <device Dname="STM32L4P5VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L4P5VGTxP' ***** -->
        <device Dname="STM32L4P5VGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="100" />
        </device>
        <!-- ***** Device 'STM32L4P5QGIx' ***** -->
        <device Dname="STM32L4P5QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="132"/>
        </device>
        <!-- ***** Device 'STM32L4P5QGIxP' ***** -->
        <device Dname="STM32L4P5QGIxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="BGA" n="132" />
        </device>
        <!-- ***** Device 'STM32L4P5ZGTx' ***** -->
        <device Dname="STM32L4P5ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
        <!-- ***** Device 'STM32L4P5ZGTxP' ***** -->
        <device Dname="STM32L4P5ZGTxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="144" />
        </device>
        <!-- ***** Device 'STM32L4P5AGIx' ***** -->
        <device Dname="STM32L4P5AGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="169"/>
        </device>
        <!-- ***** Device 'STM32L4P5AGIxP' ***** -->
        <device Dname="STM32L4P5AGIxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="BGA" n="169" />
        </device>
