pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
        <!-- ***** Device 'STM32L4P5CGUx' ***** -->
        <device Dname="STM32L4P5CGUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="48" />
        </device>
        <!-- ***** Device 'STM32L4P5CGUxP' ***** -->
        <device Dname="STM32L4P5CGUxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="QFP" n="48" />
        </device>
        <!-- ***** Device 'STM32L4P5VGYx' ***** -->
        <device Dname="STM32L4P5VGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="CSP" n="100" />
        </device>
        <!-- ***** Device 'STM32L4P5VGYxP' ***** -->
        <device Dname="STM32L4P5VGYxP">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <feature type="CSP" n="100" />
        </device>

        <!-- ################ 512 KB ################ -->
        <!-- ***** Device 'STM32L4P5AEIx'  ****** -->
        <device Dname="STM32L4P5AEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="BGA" n="169"/>
        </device>
        <!-- ***** Device 'STM32L4P5CETx'  ****** -->
        <device Dname="STM32L4P5CETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- ***** Device 'STM32L4P5CEUx'  ****** -->
        <device Dname="STM32L4P5CEUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- ***** Device 'STM32L4P5QEIx'  ****** -->
        <device Dname="STM32L4P5QEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="BGA" n="132"/>
        </device>
        <!-- ***** Device 'STM32L4P5RETx'  ****** -->
        <device Dname="STM32L4P5RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- ***** Device 'STM32L4P5VETx'  ****** -->
        <device Dname="STM32L4P5VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L4P5VEYx'  ****** -->
        <device Dname="STM32L4P5VEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="CSP" n="100"/>
        </device>
        <!-- ***** Device 'STM32L4P5ZE'  ****** -->
        <device Dname="STM32L4P5ZETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1" />
          <feature type="QFP" n="144"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L4">
      <description>STMicroelectronics STM32L4 Series Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4*"/>
    </condition>
    <condition id="STM32L412">
      <description>STMicroelectronics STM32L412 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L412*"/>
    </condition>
    <condition id="STM32L422">
      <description>STMicroelectronics STM32L422 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L422*"/>
    </condition>
    <condition id="STM32L431">
      <description>STMicroelectronics STM32L431 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L431*"/>
    </condition>
