pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <condition id="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL</description>
      <require condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>STMicroelectronics STM32L431/432/433/442/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL</description>
      <require condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>STMicroelectronics STM32L412/422/432/433/442/443/452/462/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL</description>
      <require condition="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L4 HAL DMA">
      <description>STMicroelectronics STM32L4 Device and HAL with DMA</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L4A6_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L4A6/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L4A6_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L422_442_443_462_485_486_4A6_4S5_4S7_4S9_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L422_442/443/462/485/486/4A6/4S5/4S7/4S9/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L422_442_443_462_485_486_4A6_4S5_4S7_4S9_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL</description>
      <require condition="STM32L451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6 HAL DMA">
      <description>STMicroelectronics STM32L431/432/433/442/443/471/475/476/485/486/496/4A6 Device and HAL with DMA</description>
      <require condition="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L431/433/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L431/432/433/442/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L412_422_431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6 HAL DMA">
      <description>STMicroelectronics STM32L412/422/431/432/433/442/443/451/452/462/471/475/476/485/486/496/4A6 Device and HAL with DMA</description>
      <require condition="STM32L412_422_431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L4P5_4Q5 HAL DMA">
      <description>STMicroelectronics STM32L4P5/4Q5 Device and HAL with DMA</description>
      <require condition="STM32L4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <!-- LL driver Conditions -->
    <condition id="STM32L4 LL">
      <description>STMicroelectronics STM32L4 Device and LL</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L4 LL Common">
      <description>STMicroelectronics STM32L4 Device and LL</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>
    <condition id="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L4496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6 LL">
      <description>STMicroelectronics STM32L431/432/433/442/443/471/475/476/485/486/496/4A6 Device and LL</description>
      <require condition="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L412_422_431_432_433_442_443_451_452_462_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L412/422/431/432/433/442/443/451/452/462/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L412_422_431_432_433_442_443_451_452_462_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L412/422/432/433/442/443/452/462/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L431/433/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>STMicroelectronics STM32L431/432//433/442/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Device and LL</description>
      <require condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32L4Q5 LL">
      <description>STMicroelectronics STM32L4Q5 Device and LL</description>
      <require condition="STM32L4Q5"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="STM32L4 CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
