pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <condition id="STM32L4 CMSIS_Driver MCI">
      <description>Requirement for CMSIS MCI Driver</description>
      <require condition="STM32L412_422_431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"/>
    </condition>
    <condition id="STM32L4PLUS CMSIS_Driver MCI">
      <description>Requirement for CMSIS MCI Driver</description>
      <require condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"/>
    </condition>
    <condition id="STM32L4 CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Smartcard"/>
    </condition>
    <condition id="STM32L4 CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI"/>
    </condition>
    <condition id="STM32L412_422_432_433_442_443_452_462 CMSIS_Driver USBD">
      <description>Requirement for CMSIS USB0 Device Driver</description>
      <require condition="STM32L412_422_432_433_442_443_452_462"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"/>
    </condition>
    <condition id="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBD">
      <description>Requirement for CMSIS USB0 Device Driver (OTG)</description>
      <require condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"/>
    </condition>
    <condition id="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBH">
      <description>Requirement for CMSIS USB0 Host Driver (OTG)</description>
      <require condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="HCD"/>
    </condition>

    <!-- STM32L496G_Discovery BSP Conditions -->
    <condition id="STM32L476G-EVAL BSP">
      <description>STMicroelectronics STM32L496G-Discovery BSP</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP Audio">
      <description>STMicroelectronics STM32L496G-Discovery BSP Audio</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32L496G-Discovery BSP Camera</description>
      <require condition="STM32L476"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP Glass-LCD">
      <description>STMicroelectronics STM32L496G-Discovery BSP Glass-LCD</description>
      <require condition="STM32L476"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP IDD">
      <description>STMicroelectronics STM32L496G-Discovery BSP IDD</description>
      <require condition="STM32L476"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP IO">
      <description>STMicroelectronics STM32L496G-Discovery BSP IO</description>
      <require condition="STM32L476"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP LCD">
      <description>STMicroelectronics STM32L496G-Discovery BSP LCD</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LCD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP NOR">
      <description>STMicroelectronics STM32L476G-EVAL BSP NOR</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP QSPI">
      <description>STMicroelectronics STM32L496G-Discovery BSP QSPI</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP SD">
      <description>STMicroelectronics STM32L496G-Discovery BSP SD</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP SRAM">
      <description>STMicroelectronics STM32L496G-Discovery BSP SRAM</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L476G-EVAL BSP TS">
      <description>STMicroelectronics STM32L496G-Discovery BSP TS</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL LED">
      <description>STMicroelectronics STM32L4R9I-Eval LED</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL Buttons">
      <description>STMicroelectronics STM32L4R9I-Eval Buttons</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL Joystick">
      <description>STMicroelectronics STM32L4R9I-Eval Joystick</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L476G-EVAL ADC">
      <description>STMicroelectronics STM32L4R9I-Eval ADC</description>
      <require condition="STM32L476"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>

    <!-- STM32L496G_Discovery BSP Conditions -->
    <condition id="STM32L496G-Discovery BSP">
      <description>STMicroelectronics STM32L496G-Discovery BSP</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP Audio">
      <description>STMicroelectronics STM32L496G-Discovery BSP Audio</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP Camera">
      <description>STMicroelectronics STM32L496G-Discovery BSP Camera</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
