pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CAN"       Cversion="1.12.0" condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>Controller area network (CAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_can.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMP"      Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Analog Comparator (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.12.0" condition="STM32L4 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_crc.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_crc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP"      Cversion="1.12.0" condition="STM32L422_442_443_462_485_486_4A6_4S5_4S7_4S9_4Q5 HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_cryp.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_cryp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC"       Cversion="1.12.0" condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dac_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"      Cversion="1.12.0" condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>Digital camera interface (DCMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DCMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dcmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DFSDM"     Cversion="1.12.0" condition="STM32L451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>Digital Filter for Sigma-Delta Modulators (DFSDM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DFSDM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dfsdm.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dfsdm_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.12.0" condition="STM32L4 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dma_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"     Cversion="1.12.0" condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>Chrom-Art Accelerator (DMA2D) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA2D
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dma2d.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"       Cversion="1.12.0" condition="STM32L4R9_4S9 HAL">
      <description>DSI HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DSI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_dsi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI"      Cversion="1.12.0" condition="STM32L4 HAL">
      <description>EXTI HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="FIREWALL"  Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Firewall HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FIREWALL
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_firewall.c"/>
      </files>
    </component>
