pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_flash_ex.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_flash_ramfunc.c" condition="STM32L4A6_4R5_4R7_4R9_4S5_4S7_4S9"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GFXMMU"    Cversion="1.12.0" condition="STM32L4R7_4R9_4S7_4S9 HAL">
      <description>GFXMMU HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GFXMMU
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_gfxmmu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.12.0" condition="STM32L4 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH"      Cversion="1.12.0" condition="STM32L4A6_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_hash.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_hash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HCD"       Cversion="1.12.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>USB Host controller (HCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_hcd.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.12.0" condition="STM32L4 HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_i2c_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"      Cversion="1.12.0" condition="STM32L4 HAL DMA">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_irda.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG"      Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LCD"       Cversion="1.12.0" condition="STM32L433_443_476_486_496_4A6 HAL">
      <description>LCD Controller (LCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_lcd.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM"     Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Low-power timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_lptim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"      Cversion="1.12.0" condition="STM32L4R7_4R9_4S7_4S9_4P5_4Q5 HAL">
      <description>LCD-TFT Controller (LTDC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LTDC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_ltdc.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_ltdc_ex.c" condition="STM32L4R9_4S9"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"      Cversion="1.10.0" condition="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>MMC Controller (MMC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_mmc.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_mmc_ex.c" condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"      Cversion="1.10.0" condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>NAND Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NAND
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_nand.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"       Cversion="1.12.0" condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>NOR Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NOR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_nor.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_fmc.c"/>
      </files>
    </component>
