pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"      Cversion="1.12.0" condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL DMA">
      <description>SRAM controller (SRAM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SRAM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_sram.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SWPMI"     Cversion="1.12.0" condition="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6 HAL DMA">
      <description>Single Wire Protocol Master Interface (SWPMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SWPMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_swpmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"       Cversion="1.12.0" condition="STM32L4 HAL DMA">
      <description>Timers (TIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_tim.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_tim_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="TSC"       Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Touch Sensing Controller (TSC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TSC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_tsc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"      Cversion="1.12.0" condition="STM32L4 HAL DMA">
      <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_UART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_uart.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_uart_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART"     Cversion="1.12.0" condition="STM32L4 HAL DMA">
      <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_usart.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_usart_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG"      Cversion="1.12.0" condition="STM32L4 HAL">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_wwdg.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics STM32CubeL4 HAL -->

    <!-- START: STMicroelectronics STM32CubeL4 LL -->
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="Common" Cversion="1.12.0" condition="STM32L4 LL Common">
      <description>Common LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32L4xx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32L4xx_HAL_Driver/Inc/Legacy/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="ADC"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Analog-to-digital converter (ADC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_adc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="COMP"   Cversion="1.12.0" condition="STM32L4 LL">
      <description>Analog Comparator (CRC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="CRC"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>CRC calculation unit (CRC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="CRS"    Cversion="1.12.0" condition="STM32L412_422_431_432_433_442_443_451_452_462_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>Clock recovery system (CRS) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_CRS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_crs.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DAC"    Cversion="1.12.0" condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>Digital-to-analog converter (DAC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_dac.c"/>
      </files>
    </component>
