pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DMA"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>DMA controller (DMA) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DMA2D"  Cversion="1.12.0" condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>Chrom-Art Accelerator (DMA2D) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DMA2D
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_dma2d.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="EXTI"   Cversion="1.12.0" condition="STM32L4 LL">
      <description>Extended interrupts and events controler (EXTI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="FMC"    Cversion="1.12.0" condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>Flexible memory controller (FMC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_FMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="GPIO"   Cversion="1.12.0" condition="STM32L4 LL">
      <description>General-purpose I/O (GPIO) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="I2C"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Inter-integrated circuit (I2C) interface LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="LPTIM"  Cversion="1.12.0" condition="STM32L4 LL">
      <description>Low-power timer (LPTIM) interface LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_lptim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="LPUART" Cversion="1.12.0" condition="STM32L4 LL">
      <description>Low-power universal asynchronous receiver transmitter (LPUART) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_LPUART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_lpuart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="OPAMP"  Cversion="1.12.0" condition="STM32L4 LL">
      <description>Operational amplifier (OPAMP) peripheral LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_OPAMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_opamp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="PKA"       Cversion="1.12.0" condition="STM32L4Q5 LL">
      <description>Public Key Accelerator (PKA) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_PKA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_pka.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Power controller (PWR) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_pwr.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Reset and clock control (RCC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rcc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RNG"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Random number generator (RNG) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RTC"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Real-time clock (RTC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SDMMC"  Cversion="1.12.0" condition="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>SD/SDIO/MMC card host interface (SDMMC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SDMMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SPI"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Serial peripheral interface (SPI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SWPMI"  Cversion="1.12.0" condition="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6 LL">
      <description>Single Wire Protocol Master Interface (SWPMI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SWPMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_swpmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="TIM"    Cversion="1.12.0" condition="STM32L4 LL">
      <description>Timers (TIM) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_tim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USART"  Cversion="1.12.0" condition="STM32L4 LL">
      <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USB"    Cversion="1.12.0" condition="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 LL">
      <description>Universal serial bus full-speed device interface (USB) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USB
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.12.0" condition="STM32L4">
      <description>UTILS LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_UTILS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_utils.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics STM32CubeL4 LL -->

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0" Cversion="1.0.0" condition="STM32L4 CMSIS_Driver I2C">
      <description>I2C Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI"                          Capiversion="2.2.0" Cversion="1.3.0" condition="STM32L4 CMSIS_Driver MCI">
      <description>MCI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI"                          Capiversion="2.2.0" Cversion="1.2.0" condition="STM32L4PLUS CMSIS_Driver MCI">
      <description>MCI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
        #define RTE_Drivers_MCI1                /* Driver MCI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32L4plus.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"                          Capiversion="2.1.0" Cversion="1.3.0" condition="STM32L4 CMSIS_Driver SPI">
      <description>SPI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"                        Capiversion="2.1.0" Cversion="1.4.0" condition="STM32L4 CMSIS_Driver USART">
      <description>USART Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.3.0" condition="STM32L412_422_432_433_442_443_452_462 CMSIS_Driver USBD">
      <description>USB Device Full-Speed Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USBD_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.4.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBD">
      <description>USB Device Full-Speed Driver (OTG) for STM32L4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_OTG_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Csub="Full-speed" Capiversion="2.2.0" Cversion="1.1.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBH">
      <description>USB Host Full-Speed Driver (OTG) for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_OTG_STM32L4xx.c"/>
      </files>
    </component>

    <!-- STM32L476G-EVAL Board Support -->
    <bundle Cbundle="STM32L476G-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L476G-EVAL Board</description>
      <doc>MDK/Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"          condition="STM32L476G-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"              condition="STM32L476G-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
