pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
      <component Cgroup="Drivers" Csub="EEPROM"             condition="STM32L476G-EVAL BSP EEPROM">
        <description>EEPROM for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Glass-LCD"          condition="STM32L476G-EVAL BSP Glass-LCD">
        <description>Glass-LCD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32L476G-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                condition="STM32L476G-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe1600/stmpe1600.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                condition="STM32L476G-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/hx8347g/hx8347g.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                condition="STM32L476G-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI"               condition="STM32L476G-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                 condition="STM32L476G-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"               condition="STM32L476G-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"       condition="STM32L476G-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="STM32L476G-EVAL LED">
        <description>LED driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/LED_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="STM32L476G-EVAL Buttons">
        <description>Button driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="sourceC" name="MDK/Boards/ST/STM32L476G-EVAL/Common/Buttons_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0" condition="STM32L476G-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/Joystick_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32L476G-EVAL ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L476G-EVAL/Common/ADC_STM32L476G-EVAL.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32L496G_Discovery Board -->
    <bundle Cbundle="STM32L496G-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32L496G-Discovery Board</description>
      <doc>MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00353127.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"     condition="STM32L496G-Discovery BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"         condition="STM32L496G-Discovery BSP Audio">
        <description>Audio for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/cs42l51/cs42l51.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera"        condition="STM32L496G-Discovery BSP Camera">
        <description>Camera for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/ov9655/ov9655.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"           condition="STM32L496G-Discovery BSP IDD">
        <description>IDD for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_idd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
