pyocd/pyOCD/test/data/packs/Keil.STM32L4xx_DFP.2.5.0.pdsc
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32L4R9I-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_idd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                condition="STM32L4R9I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                condition="STM32L4R9I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="OSPI-NOR"           condition="STM32L4R9I-EVAL BSP OSPI-NOR">
        <description>OSPI-NOR Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_nor.c"/>
          <!--file category="source" name="Drivers/BSP/Components/mx25lm51245g/mx25lm51245g.h"/-->
        </files>
      </component>
      <component Cgroup="Drivers" Csub="OSPI-RAM"           condition="STM32L4R9I-EVAL BSP OSPI-RAM">
        <description>OSPI-RAM Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_ram.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_ram.c"/>
          <!--file category="source" name="Drivers/BSP/Components/iss66wvh8m8/iss66wvh8m8.h"/-->
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RGB-LCD"            condition="STM32L4R9I-EVAL BSP RGB-LCD">
        <description>RGB-LCD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_lcd.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_lcd.c"/>
          <!--file category="source" name="Drivers/BSP/Components/rk043fn48h/rk043fn48h.h"/-->
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RGB-TS"             condition="STM32L4R9I-EVAL BSP RGB-TS">
        <description>RGB-TS for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ts.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_rgb_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                 condition="STM32L4R9I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"               condition="STM32L4R9I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="STM32L4R9I-EVAL LED">
        <description>LED Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/LED_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="STM32L4R9I-EVAL Buttons">
        <description>Buttons Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/Buttons_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0" condition="STM32L4R9I-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/Joystick_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32L4R9I-EVAL ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L4R9I-EVAL/Common/ADC_STM32L4R9I-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

